// app/news/newsData.js

// Export news articles as a module to ensure consistency across components
export const newsArticles = [
    {
      id: 1,
      slug: 'league-of-legends-tournament',
      title: 'League of Legends: بطولة نهاية الأسبوع',
      description:
        'انضم إلى بطولة 5 ضد 5 هذا الأسبوع مع جوائز بقيمة 500 دولار. سجل فريقك الآن!',
      category: 'البطولات',
      date: '3 أبريل 2025',
      imageSrc: '/temp/fifa.jpg',
      content: 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربي، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التي يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربي زيادة عدد الفقرات كما تريد.'
    },
    {
      id: 2,
      slug: 'extended-hours-spring-break',
      title: 'ساعات عمل إضافية خلال عطلة الربيع',
      description:
        'نقوم بتمديد ساعات العمل لدينا حتى الساعة 2 صباحًا خلال أسبوع عطلة الربيع للمزيد من الوقت للألعاب!',
      category: 'الإعلانات',
      date: '2 أبريل 2025',
      imageSrc: '/temp/fifa.jpg',
      content: 'خلال عطلة الربيع، سنقوم بتمديد ساعات عملنا لتلبية الطلب المتزايد. يمكنك الاستمتاع بألعابك المفضلة حتى وقت متأخر من الليل. نتطلع إلى استضافتك ومنحك تجربة لعب استثنائية خلال هذه العطلة.'
    },
    {
      id: 3,
      slug: 'new-food-and-drinks-menu',
      title: 'قائمة طعام ومشروبات جديدة متاحة',
      description:
        'تحقق من قائمة الطعام الجديدة المستوحاة من الألعاب مع مشروبات الطاقة والوجبات الخفيفة لتعزيز جلسات اللعب.',
      category: 'الطعام',
      date: '30 مارس 2025',
      imageSrc: '/temp/fifa.jpg',
      content: 'يسعدنا أن نعلن عن إطلاق قائمة طعام ومشروبات جديدة كليًا مستوحاة من عالم الألعاب. تتضمن القائمة مجموعة متنوعة من الوجبات الخفيفة والمشروبات المصممة خصيصًا لتعزيز تجربة اللعب لديك. جرب مشروبات الطاقة الجديدة والوجبات السريعة اللذيذة التي ستبقيك في حالة تركيز أثناء جلسات اللعب الطويلة.'
    },
  ];